СтараяНоваяМетодики/AccumulationRegisters/Расш1_ОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Расш1_ОстаткиНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

СтараяНоваяМетодики/CommonModules/РаботаСДанными/Ext/Module.bsl
Процедура ОбработкаПроведенияРеализацииОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	ДвиженияРеализации = Источник.Движения.Расш1_ОстаткиНоменклатуры;
	ТЧ_Товары = Источник.Товары;
	ДатаДокумента = Источник.Дата;
	СкладДокумента = Источник.Склад;
	ОрганизацияДокумента = Источник.Организация;
	ДвиженияРеализации.Записывать = Истина;  
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПриобретениеТоваровУслуг") Тогда
		Для каждого Строка Из ТЧ_Товары Цикл
				Движения = ДвиженияРеализации.ДобавитьПриход();
				Движения.Период = ДатаДокумента;
				Движения.Номенклатура = Строка.Номенклатура;
				Движения.Склад = СкладДокумента;
				Движения.Организация = ОрганизацияДокумента;
				Движения.Количество = Строка.Количество;  
		КонецЦикла;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда	
		Если Источник.Расш1_Методика = "Новая" тогда
	
			Для каждого Строка Из ТЧ_Товары Цикл
				Движения = ДвиженияРеализации.ДобавитьРасход();
				Движения.Период = ДатаДокумента;
				Движения.Номенклатура = Строка.Номенклатура;
				Движения.Склад = СкладДокумента;
				Движения.Организация = ОрганизацияДокумента;
				Движения.Количество = Строка.Количество;
			КонецЦикла;
			
			ДвиженияРеализации.БлокироватьДляИзменения = Истина;
			ДвиженияРеализации.Записать(); 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПРЕДСТАВЛЕНИЕ(Расш1_ОстаткиНоменклатурыОстатки.Номенклатура) КАК НоменклатураПредставление,
				|	Расш1_ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
				|ИЗ
				|	РегистрНакопления.Расш1_ОстаткиНоменклатуры.Остатки(
				|			&Граница,
				|			Номенклатура В (&МассивТоваров)
				|				И Организация = &Организация
				|				И Склад = &Склад) КАК Расш1_ОстаткиНоменклатурыОстатки
				|ГДЕ
				|	Расш1_ОстаткиНоменклатурыОстатки.КоличествоОстаток < 0";
			
			Запрос.УстановитьПараметр("Граница", Новый Граница(Источник.МоментВремени(), ВидГраницы.Включая));
			Запрос.УстановитьПараметр("МассивТоваров", ТЧ_Товары.ВыгрузитьКолонку("Номенклатура"));
			Запрос.УстановитьПараметр("Организация", ОрганизацияДокумента);
			Запрос.УстановитьПараметр("Склад", СкладДокумента);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда 
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						Отказ = Истина;  
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = СтрШаблон("Не хватает товара %1 в количестве %2!", ВыборкаДетальныеЗаписи.НоменклатураПредставление, 
													ВыборкаДетальныеЗаписи.КоличествоОстаток); 
						Сообщение.Сообщить();
					КонецЦикла;
			КонецЕсли;		
    Иначе 
			ДвиженияРеализации.Записать();
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Расш1_ОстаткиНоменклатуры");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = Источник.Товары;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
			Блокировка.Заблокировать();
			
			СписокТоваров = ТЧ_Товары.ВыгрузитьКолонку("Номенклатура");
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
				|	РеализацияТоваровУслугТовары.Количество КАК Количество
				|ПОМЕСТИТЬ ВТ_ТабЧасть
				|ИЗ
				|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
				|ГДЕ
				|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Номенклатура
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Расш1_ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
				|	ПРЕДСТАВЛЕНИЕ(Расш1_ОстаткиНоменклатурыОстатки.Номенклатура) КАК НоменклатураПредставление,
				|	Расш1_ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток,
				|	ВТ_ТабЧасть.Количество КАК Количество
				|ИЗ
				|	ВТ_ТабЧасть КАК ВТ_ТабЧасть
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Расш1_ОстаткиНоменклатуры.Остатки(
				|				&МоментВремени,
				|				Номенклатура В (&МассивТоваров)
				|					И Организация = &Организация
				|					И Склад = &Склад) КАК Расш1_ОстаткиНоменклатурыОстатки
				|		ПО ВТ_ТабЧасть.Номенклатура = Расш1_ОстаткиНоменклатурыОстатки.Номенклатура";
			
			Запрос.УстановитьПараметр("МассивТоваров", СписокТоваров);
			Запрос.УстановитьПараметр("МоментВремени", Источник.МоментВремени());
			Запрос.УстановитьПараметр("Организация", ОрганизацияДокумента);
			Запрос.УстановитьПараметр("Склад", СкладДокумента);
			Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка); 
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаТовары = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаТовары.Следующий() Цикл  
					Превышение = ВыборкаТовары.Количество - ВыборкаТовары.КоличествоОстаток;
					Если Превышение > 0 Тогда
						Отказ = Истина;
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = СтрШаблон("Не хватает товара %1 в количестве %2!", ВыборкаТовары.НоменклатураПредставление, Превышение); 
						Сообщение.Сообщить(); 
					КонецЕсли;
					Если Отказ Тогда
					    Продолжить;
					КонецЕсли;
				Движения = ДвиженияРеализации.ДобавитьРасход();
				Движения.Период = ДатаДокумента;
				Движения.Номенклатура = ВыборкаТовары.Номенклатура;
				Движения.Склад = СкладДокумента;
				Движения.Организация = ОрганизацияДокумента;
				Движения.Количество = ВыборкаТовары.Количество;
			КонецЦикла;
	КонецЕсли;	
КонецЕсли;    
КонецПроцедуры
